{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "390ed7cc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Высота: 3\n",
      "Ширина: 5\n",
      "*****\n",
      "*****\n",
      "*****\n"
     ]
    }
   ],
   "source": [
    "'''1. Рисование прямоугольника из звездочек:\n",
    "Задача: Напишите программу, которая рисует прямоугольник из звездочек (*).\n",
    "Пользователь вводит высоту и ширину прямоугольника (по очереди примите два значения от пользователя, не одновременно).\n",
    "Инструменты: Используйте внешний цикл for для перебора строк и внутренний цикл for для перебора столбцов в каждой строке.\n",
    "Используйте print\n",
    "Вывод:\n",
    " - Предположим, пользователь вводит высоту 3 и ширину 5. Тогда вывод программы будет следующим:\n",
    "     *****\n",
    "     *****\n",
    "     *****'''\n",
    "\n",
    "a, b = int(input('Высота: ')), int(input('Ширина: '))\n",
    "for _ in range(a):\n",
    "    for _ in range(b):\n",
    "        print('*',end='')\n",
    "    print()\n",
    "    \n",
    "# for _ in range(a):\n",
    "#     print('*'*b)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "53579f3b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number: 3\n",
      "Degree: 4\n",
      "1^1 = 1, 1^2 = 1, 1^3 = 1, 1^4 = 1\n",
      "2^1 = 2, 2^2 = 4, 2^3 = 8, 2^4 = 16\n",
      "3^1 = 3, 3^2 = 9, 3^3 = 27, 3^4 = 81\n"
     ]
    }
   ],
   "source": [
    "'''2.Таблица степеней чисел:\n",
    "Задача: Напишите программу, которая для чисел от 1 до N (N задается пользователем) выводит их степени от 1 до M (M также задается пользователем).\n",
    "Инструменты: Используйте один цикл for для перебора чисел от 1 до N и вложенный цикл for для возведения каждого числа в степени от 1 до M.\n",
    "Вывод:\n",
    "- Если пользователь задает N = 3 и M = 4, то вывод будет следующим (выводятся степени каждого числа от 1 до 4):\n",
    "     1^1 = 1, 1^2 = 1, 1^3 = 1, 1^4 = 1\n",
    "     2^1 = 2, 2^2 = 4, 2^3 = 8, 2^4 = 16\n",
    "     3^1 = 3, 3^2 = 9, 3^3 = 27, 3^4 = 81'''\n",
    "\n",
    "n, m = int(input('Number: ')), int(input('Degree: '))\n",
    "# for i in range(1,n+1):\n",
    "#     for j in range(1,m+1):\n",
    "#         if j!=m:\n",
    "#             print(str(i)+'^'+str(j),'=',i**j,end=', ')\n",
    "#         else:\n",
    "#             print(str(i)+'^'+str(j),'=',i**j, end='\\n')\n",
    "            \n",
    "for i in range(1,n+1):\n",
    "    for j in range(1,m):\n",
    "            print(str(i)+'^'+str(j),'=',i**j,end=', ')\n",
    "    else:\n",
    "        print(str(i)+'^'+str(m),'=',i**m, end='\\n')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "4cddb870",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10\n",
      "10\n",
      "9\n",
      "8\n",
      "7\n",
      "6\n",
      "5\n",
      "4\n",
      "3\n",
      "2\n",
      "1\n",
      "Время истекло!\n"
     ]
    }
   ],
   "source": [
    "'''1. Создание простого счетчика времени:\n",
    "Задача: Напишите программу, которая ведет обратный отсчет от заданного пользователем времени в секундах до нуля.\n",
    "Инструменты: Используйте цикл while для уменьшения счетчика каждую секунду и вывода оставшегося времени.\n",
    "Программа должна остановиться, когда счетчик достигнет нуля.\n",
    "Вывод:\n",
    "- Если пользователь задает время 5 секунд, то вывод будет выглядеть так:\n",
    "     5\n",
    "     4\n",
    "     3\n",
    "     2\n",
    "     1\n",
    "     Время истекло!'''\n",
    "\n",
    "n = int(input())\n",
    "while n>0:\n",
    "    print(n)\n",
    "    n -= 1\n",
    "else:\n",
    "    print('Время истекло!')\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "dc37fa2a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Ваше число: 50\n",
      "Загаданное число меньше!\n",
      "Ваше число: 25\n",
      "Загаданное число больше!\n",
      "Ваше число: 37\n",
      "Загаданное число больше!\n",
      "Ваше число: 43\n",
      "Загаданное число больше!\n",
      "Ваше число: 47\n",
      "Загаданное число меньше!\n",
      "Ваше число: 45\n",
      "Загаданное число больше!\n",
      "Ваше число: 46\n",
      "Вы угадали число!\n"
     ]
    }
   ],
   "source": [
    "'''2.Программа угадывания числа:\n",
    "Задача: Напишите программу, где компьютер загадывает число от 1 до 100, а пользователь пытается его угадать.\n",
    "После каждой попытки программа должна сообщать, больше или меньше загаданное число, чем введенное пользователем.\n",
    "Процесс продолжается до тех пор, пока число не будет угадано.\n",
    "Инструменты: Используйте цикл while для повторения действий, пока пользователь не угадает число.\n",
    "Вывод:\n",
    "- Представим, что компьютер загадал число 42, а пользователь вводит следующие числа: 50, 30, 45, 42. Тогда вывод будет таким:\n",
    "     Ваше число: 50\n",
    "     Загаданное число меньше!\n",
    "     Ваше число: 30\n",
    "     Загаданное число больше!\n",
    "     Ваше число: 45\n",
    "     Загаданное число меньше!\n",
    "     Ваше число: 42\n",
    "     Вы угадали число!'''\n",
    "\n",
    "import random as r\n",
    "\n",
    "x = r.randint(1,100)\n",
    "i = 0\n",
    "while x!=i:\n",
    "    i = int(input('Ваше число: '))\n",
    "    if i>x:\n",
    "        print('Загаданное число меньше!')\n",
    "    elif i<x:\n",
    "        print('Загаданное число больше!')\n",
    "    else:\n",
    "        print('Вы угадали число!')\n",
    "        break"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ee3c93ec",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
