{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "4ee5daeb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5050\n"
     ]
    }
   ],
   "source": [
    "'''1. Расчет Суммы Чисел: Написать программу, которая использует цикл for для вычисления суммы всех чисел от 1 до 100.'''\n",
    "\n",
    "count = 0\n",
    "for i in range(1,101):\n",
    "    count += i \n",
    "print(count)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "b6672fde",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Число от 1 до 10:9\n",
      "9 * 1 = 9\n",
      "9 * 2 = 18\n",
      "9 * 3 = 27\n",
      "9 * 4 = 36\n",
      "9 * 5 = 45\n",
      "9 * 6 = 54\n",
      "9 * 7 = 63\n",
      "9 * 8 = 72\n",
      "9 * 9 = 81\n",
      "9 * 10 = 90\n"
     ]
    }
   ],
   "source": [
    "'''2. Таблица Умножения: Используя цикл for, создать программу, которая выводит таблицу умножения для выбранного пользователем числа от 1 до 10. Например, если пользователь выберет число 5, программа должна вывести таблицу умножения на 5, то есть вот такой вывод:\n",
    "5 * 1 = 5\n",
    "5 * 2 = 10\n",
    "5 * 3 = 15\n",
    "5 * 4 = 20\n",
    "5 * 5 = 25\n",
    "5 * 6 = 30\n",
    "5 * 7 = 35\n",
    "5 * 8 = 40\n",
    "5 * 9 = 45\n",
    "5 * 10 = 50'''\n",
    "\n",
    "num = int(input('Число от 1 до 10:'))\n",
    "for i in range(1,11):\n",
    "    print(num,'*',i,'=',num*i )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "afc9b819",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 4 6 8 10 12 14 16 18 20 "
     ]
    }
   ],
   "source": [
    "'''3. Генерация Списка Четных Чисел: Написать программу, использующую цикл for, для создания и вывода списка всех четных чисел от 2 до 20.'''\n",
    "\n",
    "# for i in range(2,21,2):\n",
    "#     print(i, end=' ')\n",
    "\n",
    "for i in range(2,21):\n",
    "    if i%2==0:\n",
    "        print(i, end=' ')\n",
    "    else:\n",
    "        continue"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "8b142b43",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10\n",
      "9\n",
      "8\n",
      "7\n",
      "6\n",
      "5\n",
      "4\n",
      "3\n",
      "2\n",
      "1\n",
      "0\n",
      "Пуск!\n"
     ]
    }
   ],
   "source": [
    "'''4. Обратный Отсчет: Создать программу, которая использует цикл for для вывода обратного отсчета от 10 до 0, после чего выводит сообщение \"Пуск!\".'''\n",
    "\n",
    "for i in range(10,-1,-1):\n",
    "    print(i)\n",
    "    \n",
    "else: \n",
    "    print('Пуск!')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "8325a6b7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Напиши что нибудь: Общественное бытие определяет общественное сознание\n",
      "О\n",
      "б\n",
      "щ\n",
      "е\n",
      "с\n",
      "т\n",
      "в\n",
      "е\n",
      "н\n",
      "н\n",
      "о\n",
      "е\n",
      " \n",
      "б\n",
      "ы\n",
      "т\n",
      "и\n",
      "е\n",
      " \n",
      "о\n",
      "п\n",
      "р\n",
      "е\n",
      "д\n",
      "е\n",
      "л\n",
      "я\n",
      "е\n",
      "т\n",
      " \n",
      "о\n",
      "б\n",
      "щ\n",
      "е\n",
      "с\n",
      "т\n",
      "в\n",
      "е\n",
      "н\n",
      "н\n",
      "о\n",
      "е\n",
      " \n",
      "с\n",
      "о\n",
      "з\n",
      "н\n",
      "а\n",
      "н\n",
      "и\n",
      "е\n"
     ]
    }
   ],
   "source": [
    "'''5. Работа со Строками: Написать программу, которая принимает строку от пользователя и использует цикл for для вывода каждого символа этой строки в столбик.\n",
    "Например, для строки \"Привет\" программа должна вывести:\n",
    "П\n",
    "р\n",
    "и\n",
    "в\n",
    "е\n",
    "т\n",
    "Для решения задачи \"Работа со Строками\", где необходимо вывести каждый символ введенной строки в столбик, вы можете следовать таким шагам:\n",
    "- Получение Строки от Пользователя: Сначала нужно запросить у пользователя ввести строку.\n",
    "Это может быть реализовано с помощью функции input() в Python.\n",
    "- Использование Цикла for: Далее используйте цикл for для перебора каждого символа в строке.\n",
    "В Python строка может быть непосредственно использована в цикле for для итерации по её символам.\n",
    "- Вывод Символов: В теле цикла выведите текущий символ.\n",
    "Функция print() в Python по умолчанию добавляет символ новой строки после каждого вызова, так что каждый символ будет автоматически выводиться на новой строке.'''\n",
    "\n",
    "s = input('Напиши что нибудь: ')\n",
    "for i in s:\n",
    "    print(i)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
